# NumLayers

## Description
Function NumLayers returns the current number of layers within the active document.

```pascal
FUNCTION NumLayers : INTEGER;
```

```python
def vs.NumLayers():
    return INTEGER
```

## Version
Availability: from All Versions

## Category
* Layers